Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpd064.h
extern volatile __RPE1Rbits_t RPE1Rbits __asm__ ("RPE1R") __attribute__((section("sfrs"), address(0xBF801704)));
#define RPE14R RPE14R
extern volatile uint32_t   RPE14R __attribute__((section("sfrs"), address(0xBF801738)));
typedef struct {
  uint32_t RPE14R:5;
} __RPE14Rbits_t;
extern volatile __RPE14Rbits_t RPE14Rbits __asm__ ("RPE14R") __attribute__((section("sfrs"), address(0xBF801738)));
#define RPE15R RPE15R
extern volatile uint32_t   RPE15R __attribute__((section("sfrs"), address(0xBF80173C)));
typedef struct {
  uint32_t RPE15R:5;
} __RPE15Rbits_t;
extern volatile __RPE15Rbits_t RPE15Rbits __asm__ ("RPE15R") __attribute__((section("sfrs"), address(0xBF80173C)));
#define RPF0R RPF0R
extern volatile uint32_t   RPF0R __attribute__((section("sfrs"), address(0xBF801740)));
typedef struct {
  uint32_t RPF0R:5;
} __RPF0Rbits_t;
extern volatile __RPF0Rbits_t RPF0Rbits __asm__ ("RPF0R") __attribute__((section("sfrs"), address(0xBF801740)));
#define RPF1R RPF1R
extern volatile uint32_t   RPF1R __attribute__((section("sfrs"), address(0xBF801744)));
typedef struct {
  uint32_t RPF1R:5;
} __RPF1Rbits_t;
extern volatile __RPF1Rbits_t RPF1Rbits __asm__ ("RPF1R") __attribute__((section("sfrs"), address(0xBF801744)));
#define RPG0R RPG0R
extern volatile uint32_t   RPG0R __attribute__((section("sfrs"), address(0xBF801780)));
typedef struct {
  uint32_t RPG0R:5;
} __RPG0Rbits_t;
extern volatile __RPG0Rbits_t RPG0Rbits __asm__ ("RPG0R") __attribute__((section("sfrs"), address(0xBF801780)));
#define RPG1R RPG1R
extern volatile uint32_t   RPG1R __attribute__((section("sfrs"), address(0xBF801784)));
typedef struct {
  uint32_t RPG1R:5;
} __RPG1Rbits_t;
extern volatile __RPG1Rbits_t RPG1Rbits __asm__ ("RPG1R") __attribute__((section("sfrs"), address(0xBF801784)));
#define RPG6R RPG6R
extern volatile uint32_t   RPG6R __attribute__((section("sfrs"), address(0xBF801798)));
typedef struct {
  uint32_t RPG6R:5;
} __RPG6Rbits_t;
extern volatile __RPG6Rbits_t RPG6Rbits __asm__ ("RPG6R") __attribute__((section("sfrs"), address(0xBF801798)));
#define RPG7R RPG7R
extern volatile uint32_t   RPG7R __attribute__((section("sfrs"), address(0xBF80179C)));
typedef struct {
  uint32_t RPG7R:5;
} __RPG7Rbits_t;
extern volatile __RPG7Rbits_t RPG7Rbits __asm__ ("RPG7R") __attribute__((section("sfrs"), address(0xBF80179C)));
#define RPG8R RPG8R
extern volatile uint32_t   RPG8R __attribute__((section("sfrs"), address(0xBF8017A0)));
typedef struct {
  uint32_t RPG8R:5;
} __RPG8Rbits_t;
extern volatile __RPG8Rbits_t RPG8Rbits __asm__ ("RPG8R") __attribute__((section("sfrs"), address(0xBF8017A0)));
#define RPG9R RPG9R
extern volatile uint32_t   RPG9R __attribute__((section("sfrs"), address(0xBF8017A4)));
typedef struct {
  uint32_t RPG9R:5;
} __RPG9Rbits_t;
extern volatile __RPG9Rbits_t RPG9Rbits __asm__ ("RPG9R") __attribute__((section("sfrs"), address(0xBF8017A4)));
#define RPG12R RPG12R
extern volatile uint32_t   RPG12R __attribute__((section("sfrs"), address(0xBF8017B0)));
typedef struct {
  uint32_t RPG12R:5;
} __RPG12Rbits_t;
extern volatile __RPG12Rbits_t RPG12Rbits __asm__ ("RPG12R") __attribute__((section("sfrs"), address(0xBF8017B0)));
#define HLVDCON HLVDCON
extern volatile uint32_t   HLVDCON __attribute__((section("sfrs"), address(0xBF801800)));
typedef struct {
  uint32_t HLVDL:4;
  uint32_t :4;
  uint32_t HLEVT:1;
  uint32_t :1;
  uint32_t BGVST:1;
  uint32_t VDIR:1;
  uint32_t :1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
} __HLVDCONbits_t;
extern volatile __HLVDCONbits_t HLVDCONbits __asm__ ("HLVDCON") __attribute__((section("sfrs"), address(0xBF801800)));
extern volatile uint32_t        HLVDCONCLR __attribute__((section("sfrs"),address(0xBF801804)));
extern volatile uint32_t        HLVDCONSET __attribute__((section("sfrs"),address(0xBF801808)));
extern volatile uint32_t        HLVDCONINV __attribute__((section("sfrs"),address(0xBF80180C)));
#define INTCON INTCON
extern volatile uint32_t   INTCON __attribute__((section("sfrs"), address(0xBF810000)));
typedef struct {
  uint32_t INT0EP:1;
  uint32_t INT1EP:1;
  uint32_t INT2EP:1;
  uint32_t INT3EP:1;
  uint32_t INT4EP:1;
  uint32_t :3;
  uint32_t TPC:3;
  uint32_t :1;
  uint32_t MVEC:1;
  uint32_t :11;
  uint32_t NMIKEY:8;
} __INTCONbits_t;
extern volatile __INTCONbits_t INTCONbits __asm__ ("INTCON") __attribute__((section("sfrs"), address(0xBF810000)));
extern volatile uint32_t        INTCONCLR __attribute__((section("sfrs"),address(0xBF810004)));
extern volatile uint32_t        INTCONSET __attribute__((section("sfrs"),address(0xBF810008)));
extern volatile uint32_t        INTCONINV __attribute__((section("sfrs"),address(0xBF81000C)));
#define PRISS PRISS
extern volatile uint32_t   PRISS __attribute__((section("sfrs"), address(0xBF810010)));
typedef struct {
  uint32_t SS0:1;
  uint32_t :3;
  uint32_t PRI1SS:4;
  uint32_t PRI2SS:4;
  uint32_t PRI3SS:4;
  uint32_t PRI4SS:4;
  uint32_t PRI5SS:4;
  uint32_t PRI6SS:4;
  uint32_t PRI7SS:4;
} __PRISSbits_t;
extern volatile __PRISSbits_t PRISSbits __asm__ ("PRISS") __attribute__((section("sfrs"), address(0xBF810010)));
extern volatile uint32_t        PRISSCLR __attribute__((section("sfrs"),address(0xBF810014)));
extern volatile uint32_t        PRISSSET __attribute__((section("sfrs"),address(0xBF810018)));
extern volatile uint32_t        PRISSINV __attribute__((section("sfrs"),address(0xBF81001C)));
#define INTSTAT INTSTAT
extern volatile uint32_t   INTSTAT __attribute__((section("sfrs"), address(0xBF810020)));
typedef struct {
  uint32_t SIRQ:8;
  uint32_t SRIPL:3;
} __INTSTATbits_t;
extern volatile __INTSTATbits_t INTSTATbits __asm__ ("INTSTAT") __attribute__((section("sfrs"), address(0xBF810020)));
extern volatile uint32_t        INTSTATCLR __attribute__((section("sfrs"),address(0xBF810024)));
extern volatile uint32_t        INTSTATSET __attribute__((section("sfrs"),address(0xBF810028)));
extern volatile uint32_t        INTSTATINV __attribute__((section("sfrs"),address(0xBF81002C)));
#define IPTMR IPTMR
extern volatile uint32_t   IPTMR __attribute__((section("sfrs"), address(0xBF810030)));
typedef struct {
  uint32_t IPTMR:32;
} __IPTMRbits_t;
