Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpd064.h
extern volatile __OFF057bits_t OFF057bits __asm__ ("OFF057") __attribute__((section("sfrs"), address(0xBF810624)));
#define OFF058 OFF058
extern volatile uint32_t   OFF058 __attribute__((section("sfrs"), address(0xBF810628)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF058bits_t;
extern volatile __OFF058bits_t OFF058bits __asm__ ("OFF058") __attribute__((section("sfrs"), address(0xBF810628)));
#define OFF059 OFF059
extern volatile uint32_t   OFF059 __attribute__((section("sfrs"), address(0xBF81062C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF059bits_t;
extern volatile __OFF059bits_t OFF059bits __asm__ ("OFF059") __attribute__((section("sfrs"), address(0xBF81062C)));
#define OFF060 OFF060
extern volatile uint32_t   OFF060 __attribute__((section("sfrs"), address(0xBF810630)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF060bits_t;
extern volatile __OFF060bits_t OFF060bits __asm__ ("OFF060") __attribute__((section("sfrs"), address(0xBF810630)));
#define OFF061 OFF061
extern volatile uint32_t   OFF061 __attribute__((section("sfrs"), address(0xBF810634)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF061bits_t;
extern volatile __OFF061bits_t OFF061bits __asm__ ("OFF061") __attribute__((section("sfrs"), address(0xBF810634)));
#define OFF062 OFF062
extern volatile uint32_t   OFF062 __attribute__((section("sfrs"), address(0xBF810638)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF062bits_t;
extern volatile __OFF062bits_t OFF062bits __asm__ ("OFF062") __attribute__((section("sfrs"), address(0xBF810638)));
#define OFF063 OFF063
extern volatile uint32_t   OFF063 __attribute__((section("sfrs"), address(0xBF81063C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF063bits_t;
extern volatile __OFF063bits_t OFF063bits __asm__ ("OFF063") __attribute__((section("sfrs"), address(0xBF81063C)));
#define OFF064 OFF064
extern volatile uint32_t   OFF064 __attribute__((section("sfrs"), address(0xBF810640)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF064bits_t;
extern volatile __OFF064bits_t OFF064bits __asm__ ("OFF064") __attribute__((section("sfrs"), address(0xBF810640)));
#define OFF065 OFF065
extern volatile uint32_t   OFF065 __attribute__((section("sfrs"), address(0xBF810644)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF065bits_t;
extern volatile __OFF065bits_t OFF065bits __asm__ ("OFF065") __attribute__((section("sfrs"), address(0xBF810644)));
#define OFF066 OFF066
extern volatile uint32_t   OFF066 __attribute__((section("sfrs"), address(0xBF810648)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF066bits_t;
extern volatile __OFF066bits_t OFF066bits __asm__ ("OFF066") __attribute__((section("sfrs"), address(0xBF810648)));
#define OFF067 OFF067
extern volatile uint32_t   OFF067 __attribute__((section("sfrs"), address(0xBF81064C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF067bits_t;
extern volatile __OFF067bits_t OFF067bits __asm__ ("OFF067") __attribute__((section("sfrs"), address(0xBF81064C)));
#define OFF068 OFF068
extern volatile uint32_t   OFF068 __attribute__((section("sfrs"), address(0xBF810650)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF068bits_t;
extern volatile __OFF068bits_t OFF068bits __asm__ ("OFF068") __attribute__((section("sfrs"), address(0xBF810650)));
#define OFF069 OFF069
extern volatile uint32_t   OFF069 __attribute__((section("sfrs"), address(0xBF810654)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF069bits_t;
extern volatile __OFF069bits_t OFF069bits __asm__ ("OFF069") __attribute__((section("sfrs"), address(0xBF810654)));
#define OFF070 OFF070
extern volatile uint32_t   OFF070 __attribute__((section("sfrs"), address(0xBF810658)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF070bits_t;
extern volatile __OFF070bits_t OFF070bits __asm__ ("OFF070") __attribute__((section("sfrs"), address(0xBF810658)));
#define OFF071 OFF071
extern volatile uint32_t   OFF071 __attribute__((section("sfrs"), address(0xBF81065C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF071bits_t;
extern volatile __OFF071bits_t OFF071bits __asm__ ("OFF071") __attribute__((section("sfrs"), address(0xBF81065C)));
#define OFF072 OFF072
extern volatile uint32_t   OFF072 __attribute__((section("sfrs"), address(0xBF810660)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF072bits_t;
extern volatile __OFF072bits_t OFF072bits __asm__ ("OFF072") __attribute__((section("sfrs"), address(0xBF810660)));
#define OFF073 OFF073
extern volatile uint32_t   OFF073 __attribute__((section("sfrs"), address(0xBF810664)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF073bits_t;
extern volatile __OFF073bits_t OFF073bits __asm__ ("OFF073") __attribute__((section("sfrs"), address(0xBF810664)));
#define OFF074 OFF074
extern volatile uint32_t   OFF074 __attribute__((section("sfrs"), address(0xBF810668)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF074bits_t;
extern volatile __OFF074bits_t OFF074bits __asm__ ("OFF074") __attribute__((section("sfrs"), address(0xBF810668)));
#define OFF075 OFF075
extern volatile uint32_t   OFF075 __attribute__((section("sfrs"), address(0xBF81066C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF075bits_t;
extern volatile __OFF075bits_t OFF075bits __asm__ ("OFF075") __attribute__((section("sfrs"), address(0xBF81066C)));
#define OFF076 OFF076
extern volatile uint32_t   OFF076 __attribute__((section("sfrs"), address(0xBF810670)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF076bits_t;
extern volatile __OFF076bits_t OFF076bits __asm__ ("OFF076") __attribute__((section("sfrs"), address(0xBF810670)));
#define OFF077 OFF077
extern volatile uint32_t   OFF077 __attribute__((section("sfrs"), address(0xBF810674)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF077bits_t;
extern volatile __OFF077bits_t OFF077bits __asm__ ("OFF077") __attribute__((section("sfrs"), address(0xBF810674)));
#define OFF078 OFF078
extern volatile uint32_t   OFF078 __attribute__((section("sfrs"), address(0xBF810678)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF078bits_t;
extern volatile __OFF078bits_t OFF078bits __asm__ ("OFF078") __attribute__((section("sfrs"), address(0xBF810678)));
#define OFF079 OFF079
extern volatile uint32_t   OFF079 __attribute__((section("sfrs"), address(0xBF81067C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF079bits_t;
