Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpd064.h
extern volatile __OFF187bits_t OFF187bits __asm__ ("OFF187") __attribute__((section("sfrs"), address(0xBF81082C)));
#define OFF188 OFF188
extern volatile uint32_t   OFF188 __attribute__((section("sfrs"), address(0xBF810830)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF188bits_t;
extern volatile __OFF188bits_t OFF188bits __asm__ ("OFF188") __attribute__((section("sfrs"), address(0xBF810830)));
#define OFF194 OFF194
extern volatile uint32_t   OFF194 __attribute__((section("sfrs"), address(0xBF810848)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF194bits_t;
extern volatile __OFF194bits_t OFF194bits __asm__ ("OFF194") __attribute__((section("sfrs"), address(0xBF810848)));
#define OFF195 OFF195
extern volatile uint32_t   OFF195 __attribute__((section("sfrs"), address(0xBF81084C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF195bits_t;
extern volatile __OFF195bits_t OFF195bits __asm__ ("OFF195") __attribute__((section("sfrs"), address(0xBF81084C)));
#define OFF196 OFF196
extern volatile uint32_t   OFF196 __attribute__((section("sfrs"), address(0xBF810850)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF196bits_t;
extern volatile __OFF196bits_t OFF196bits __asm__ ("OFF196") __attribute__((section("sfrs"), address(0xBF810850)));
#define OFF197 OFF197
extern volatile uint32_t   OFF197 __attribute__((section("sfrs"), address(0xBF810854)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF197bits_t;
extern volatile __OFF197bits_t OFF197bits __asm__ ("OFF197") __attribute__((section("sfrs"), address(0xBF810854)));
#define OFF198 OFF198
extern volatile uint32_t   OFF198 __attribute__((section("sfrs"), address(0xBF810858)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF198bits_t;
extern volatile __OFF198bits_t OFF198bits __asm__ ("OFF198") __attribute__((section("sfrs"), address(0xBF810858)));
#define OFF199 OFF199
extern volatile uint32_t   OFF199 __attribute__((section("sfrs"), address(0xBF81085C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF199bits_t;
extern volatile __OFF199bits_t OFF199bits __asm__ ("OFF199") __attribute__((section("sfrs"), address(0xBF81085C)));
#define OFF200 OFF200
extern volatile uint32_t   OFF200 __attribute__((section("sfrs"), address(0xBF810860)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF200bits_t;
extern volatile __OFF200bits_t OFF200bits __asm__ ("OFF200") __attribute__((section("sfrs"), address(0xBF810860)));
#define OFF201 OFF201
extern volatile uint32_t   OFF201 __attribute__((section("sfrs"), address(0xBF810864)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF201bits_t;
extern volatile __OFF201bits_t OFF201bits __asm__ ("OFF201") __attribute__((section("sfrs"), address(0xBF810864)));
#define OFF202 OFF202
extern volatile uint32_t   OFF202 __attribute__((section("sfrs"), address(0xBF810868)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF202bits_t;
extern volatile __OFF202bits_t OFF202bits __asm__ ("OFF202") __attribute__((section("sfrs"), address(0xBF810868)));
#define OFF203 OFF203
extern volatile uint32_t   OFF203 __attribute__((section("sfrs"), address(0xBF81086C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF203bits_t;
extern volatile __OFF203bits_t OFF203bits __asm__ ("OFF203") __attribute__((section("sfrs"), address(0xBF81086C)));
#define OFF204 OFF204
extern volatile uint32_t   OFF204 __attribute__((section("sfrs"), address(0xBF810870)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF204bits_t;
extern volatile __OFF204bits_t OFF204bits __asm__ ("OFF204") __attribute__((section("sfrs"), address(0xBF810870)));
#define OFF205 OFF205
extern volatile uint32_t   OFF205 __attribute__((section("sfrs"), address(0xBF810874)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF205bits_t;
extern volatile __OFF205bits_t OFF205bits __asm__ ("OFF205") __attribute__((section("sfrs"), address(0xBF810874)));
#define OFF206 OFF206
extern volatile uint32_t   OFF206 __attribute__((section("sfrs"), address(0xBF810878)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF206bits_t;
extern volatile __OFF206bits_t OFF206bits __asm__ ("OFF206") __attribute__((section("sfrs"), address(0xBF810878)));
#define OFF207 OFF207
extern volatile uint32_t   OFF207 __attribute__((section("sfrs"), address(0xBF81087C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF207bits_t;
extern volatile __OFF207bits_t OFF207bits __asm__ ("OFF207") __attribute__((section("sfrs"), address(0xBF81087C)));
#define OFF208 OFF208
extern volatile uint32_t   OFF208 __attribute__((section("sfrs"), address(0xBF810880)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF208bits_t;
extern volatile __OFF208bits_t OFF208bits __asm__ ("OFF208") __attribute__((section("sfrs"), address(0xBF810880)));
#define OFF209 OFF209
extern volatile uint32_t   OFF209 __attribute__((section("sfrs"), address(0xBF810884)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF209bits_t;
extern volatile __OFF209bits_t OFF209bits __asm__ ("OFF209") __attribute__((section("sfrs"), address(0xBF810884)));
#define OFF210 OFF210
extern volatile uint32_t   OFF210 __attribute__((section("sfrs"), address(0xBF810888)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF210bits_t;
extern volatile __OFF210bits_t OFF210bits __asm__ ("OFF210") __attribute__((section("sfrs"), address(0xBF810888)));
#define OFF211 OFF211
extern volatile uint32_t   OFF211 __attribute__((section("sfrs"), address(0xBF81088C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF211bits_t;
extern volatile __OFF211bits_t OFF211bits __asm__ ("OFF211") __attribute__((section("sfrs"), address(0xBF81088C)));
#define OFF212 OFF212
extern volatile uint32_t   OFF212 __attribute__((section("sfrs"), address(0xBF810890)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF212bits_t;
extern volatile __OFF212bits_t OFF212bits __asm__ ("OFF212") __attribute__((section("sfrs"), address(0xBF810890)));
#define OFF213 OFF213
extern volatile uint32_t   OFF213 __attribute__((section("sfrs"), address(0xBF810894)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF213bits_t;
extern volatile __OFF213bits_t OFF213bits __asm__ ("OFF213") __attribute__((section("sfrs"), address(0xBF810894)));
#define OFF214 OFF214
extern volatile uint32_t   OFF214 __attribute__((section("sfrs"), address(0xBF810898)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF214bits_t;
extern volatile __OFF214bits_t OFF214bits __asm__ ("OFF214") __attribute__((section("sfrs"), address(0xBF810898)));
#define OFF215 OFF215
extern volatile uint32_t   OFF215 __attribute__((section("sfrs"), address(0xBF81089C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF215bits_t;
extern volatile __OFF215bits_t OFF215bits __asm__ ("OFF215") __attribute__((section("sfrs"), address(0xBF81089C)));
#define OFF216 OFF216
extern volatile uint32_t   OFF216 __attribute__((section("sfrs"), address(0xBF8108A0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF216bits_t;
