Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpd064.h
extern volatile __I2C3BRGbits_t I2C3BRGbits __asm__ ("I2C3BRG") __attribute__((section("sfrs"), address(0xBF846440)));
extern volatile uint32_t        I2C3BRGCLR __attribute__((section("sfrs"),address(0xBF846444)));
extern volatile uint32_t        I2C3BRGSET __attribute__((section("sfrs"),address(0xBF846448)));
extern volatile uint32_t        I2C3BRGINV __attribute__((section("sfrs"),address(0xBF84644C)));
#define I2C3TRN I2C3TRN
extern volatile uint32_t   I2C3TRN __attribute__((section("sfrs"), address(0xBF846450)));
typedef struct {
  uint32_t I2CTRN:8;
} __I2C3TRNbits_t;
extern volatile __I2C3TRNbits_t I2C3TRNbits __asm__ ("I2C3TRN") __attribute__((section("sfrs"), address(0xBF846450)));
extern volatile uint32_t        I2C3TRNCLR __attribute__((section("sfrs"),address(0xBF846454)));
extern volatile uint32_t        I2C3TRNSET __attribute__((section("sfrs"),address(0xBF846458)));
extern volatile uint32_t        I2C3TRNINV __attribute__((section("sfrs"),address(0xBF84645C)));
#define I2C3RCV I2C3RCV
extern volatile uint32_t   I2C3RCV __attribute__((section("sfrs"), address(0xBF846460)));
typedef struct {
  uint32_t I2CRCV:8;
} __I2C3RCVbits_t;
extern volatile __I2C3RCVbits_t I2C3RCVbits __asm__ ("I2C3RCV") __attribute__((section("sfrs"), address(0xBF846460)));
extern volatile uint32_t        I2C3RCVCLR __attribute__((section("sfrs"),address(0xBF846464)));
extern volatile uint32_t        I2C3RCVSET __attribute__((section("sfrs"),address(0xBF846468)));
extern volatile uint32_t        I2C3RCVINV __attribute__((section("sfrs"),address(0xBF84646C)));
#define I2C4CON I2C4CON
extern volatile uint32_t   I2C4CON __attribute__((section("sfrs"), address(0xBF846600)));
typedef union {
  struct {
    uint32_t SEN:1;
    uint32_t RSEN:1;
    uint32_t PEN:1;
    uint32_t RCEN:1;
    uint32_t ACKEN:1;
    uint32_t ACKDT:1;
    uint32_t STREN:1;
    uint32_t GCEN:1;
    uint32_t SMEN:1;
    uint32_t DISSLW:1;
    uint32_t A10M:1;
    uint32_t STRICT:1;
    uint32_t SCLREL:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t DHEN:1;
    uint32_t AHEN:1;
    uint32_t SBCDE:1;
    uint32_t SDAHT:1;
    uint32_t BOEN:1;
    uint32_t SCIE:1;
    uint32_t PCIE:1;
  };
  struct {
    uint32_t :11;
    uint32_t IPMIEN:1;
    uint32_t :1;
    uint32_t I2CSIDL:1;
    uint32_t :1;
    uint32_t I2CEN:1;
  };
} __I2C4CONbits_t;
extern volatile __I2C4CONbits_t I2C4CONbits __asm__ ("I2C4CON") __attribute__((section("sfrs"), address(0xBF846600)));
extern volatile uint32_t        I2C4CONCLR __attribute__((section("sfrs"),address(0xBF846604)));
extern volatile uint32_t        I2C4CONSET __attribute__((section("sfrs"),address(0xBF846608)));
extern volatile uint32_t        I2C4CONINV __attribute__((section("sfrs"),address(0xBF84660C)));
#define I2C4STAT I2C4STAT
extern volatile uint32_t   I2C4STAT __attribute__((section("sfrs"), address(0xBF846610)));
typedef union {
  struct {
    uint32_t TBF:1;
    uint32_t RBF:1;
    uint32_t R_W:1;
    uint32_t S:1;
    uint32_t P:1;
    uint32_t D_A:1;
    uint32_t I2COV:1;
    uint32_t IWCOL:1;
    uint32_t ADD10:1;
    uint32_t GCSTAT:1;
    uint32_t BCL:1;
    uint32_t :2;
    uint32_t ACKTIM:1;
    uint32_t TRSTAT:1;
    uint32_t ACKSTAT:1;
  };
  struct {
    uint32_t :6;
    uint32_t I2CPOV:1;
  };
} __I2C4STATbits_t;
extern volatile __I2C4STATbits_t I2C4STATbits __asm__ ("I2C4STAT") __attribute__((section("sfrs"), address(0xBF846610)));
extern volatile uint32_t        I2C4STATCLR __attribute__((section("sfrs"),address(0xBF846614)));
extern volatile uint32_t        I2C4STATSET __attribute__((section("sfrs"),address(0xBF846618)));
extern volatile uint32_t        I2C4STATINV __attribute__((section("sfrs"),address(0xBF84661C)));
#define I2C4ADD I2C4ADD
extern volatile uint32_t   I2C4ADD __attribute__((section("sfrs"), address(0xBF846620)));
typedef struct {
  uint32_t I2CADD:10;
} __I2C4ADDbits_t;
extern volatile __I2C4ADDbits_t I2C4ADDbits __asm__ ("I2C4ADD") __attribute__((section("sfrs"), address(0xBF846620)));
extern volatile uint32_t        I2C4ADDCLR __attribute__((section("sfrs"),address(0xBF846624)));
extern volatile uint32_t        I2C4ADDSET __attribute__((section("sfrs"),address(0xBF846628)));
extern volatile uint32_t        I2C4ADDINV __attribute__((section("sfrs"),address(0xBF84662C)));
#define I2C4MSK I2C4MSK
extern volatile uint32_t   I2C4MSK __attribute__((section("sfrs"), address(0xBF846630)));
typedef union {
  struct {
    uint32_t I2CMSK:10;
  };
  struct {
    uint32_t AMSK:10;
  };
} __I2C4MSKbits_t;
extern volatile __I2C4MSKbits_t I2C4MSKbits __asm__ ("I2C4MSK") __attribute__((section("sfrs"), address(0xBF846630)));
extern volatile uint32_t        I2C4MSKCLR __attribute__((section("sfrs"),address(0xBF846634)));
extern volatile uint32_t        I2C4MSKSET __attribute__((section("sfrs"),address(0xBF846638)));
extern volatile uint32_t        I2C4MSKINV __attribute__((section("sfrs"),address(0xBF84663C)));
#define I2C4BRG I2C4BRG
extern volatile uint32_t   I2C4BRG __attribute__((section("sfrs"), address(0xBF846640)));
typedef struct {
  uint32_t I2CBRG:16;
} __I2C4BRGbits_t;
extern volatile __I2C4BRGbits_t I2C4BRGbits __asm__ ("I2C4BRG") __attribute__((section("sfrs"), address(0xBF846640)));
extern volatile uint32_t        I2C4BRGCLR __attribute__((section("sfrs"),address(0xBF846644)));
extern volatile uint32_t        I2C4BRGSET __attribute__((section("sfrs"),address(0xBF846648)));
extern volatile uint32_t        I2C4BRGINV __attribute__((section("sfrs"),address(0xBF84664C)));
#define I2C4TRN I2C4TRN
extern volatile uint32_t   I2C4TRN __attribute__((section("sfrs"), address(0xBF846650)));
typedef struct {
  uint32_t I2CTRN:8;
} __I2C4TRNbits_t;
extern volatile __I2C4TRNbits_t I2C4TRNbits __asm__ ("I2C4TRN") __attribute__((section("sfrs"), address(0xBF846650)));
extern volatile uint32_t        I2C4TRNCLR __attribute__((section("sfrs"),address(0xBF846654)));
extern volatile uint32_t        I2C4TRNSET __attribute__((section("sfrs"),address(0xBF846658)));
extern volatile uint32_t        I2C4TRNINV __attribute__((section("sfrs"),address(0xBF84665C)));
#define I2C4RCV I2C4RCV
extern volatile uint32_t   I2C4RCV __attribute__((section("sfrs"), address(0xBF846660)));
typedef struct {
  uint32_t I2CRCV:8;
} __I2C4RCVbits_t;
extern volatile __I2C4RCVbits_t I2C4RCVbits __asm__ ("I2C4RCV") __attribute__((section("sfrs"), address(0xBF846660)));
extern volatile uint32_t        I2C4RCVCLR __attribute__((section("sfrs"),address(0xBF846664)));
extern volatile uint32_t        I2C4RCVSET __attribute__((section("sfrs"),address(0xBF846668)));
extern volatile uint32_t        I2C4RCVINV __attribute__((section("sfrs"),address(0xBF84666C)));
#define SPI3CON SPI3CON
extern volatile uint32_t   SPI3CON __attribute__((section("sfrs"), address(0xBF847400)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI3CONbits_t;
extern volatile __SPI3CONbits_t SPI3CONbits __asm__ ("SPI3CON") __attribute__((section("sfrs"), address(0xBF847400)));
extern volatile uint32_t        SPI3CONCLR __attribute__((section("sfrs"),address(0xBF847404)));
extern volatile uint32_t        SPI3CONSET __attribute__((section("sfrs"),address(0xBF847408)));
extern volatile uint32_t        SPI3CONINV __attribute__((section("sfrs"),address(0xBF84740C)));
#define SPI3STAT SPI3STAT
extern volatile uint32_t   SPI3STAT __attribute__((section("sfrs"), address(0xBF847410)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI3STATbits_t;
extern volatile __SPI3STATbits_t SPI3STATbits __asm__ ("SPI3STAT") __attribute__((section("sfrs"), address(0xBF847410)));
extern volatile uint32_t        SPI3STATCLR __attribute__((section("sfrs"),address(0xBF847414)));
extern volatile uint32_t        SPI3STATSET __attribute__((section("sfrs"),address(0xBF847418)));
extern volatile uint32_t        SPI3STATINV __attribute__((section("sfrs"),address(0xBF84741C)));
#define SPI3BUF SPI3BUF
extern volatile uint32_t   SPI3BUF __attribute__((section("sfrs"), address(0xBF847420)));
#define SPI3BRG SPI3BRG
extern volatile uint32_t   SPI3BRG __attribute__((section("sfrs"), address(0xBF847430)));
extern volatile uint32_t        SPI3BRGCLR __attribute__((section("sfrs"),address(0xBF847434)));
extern volatile uint32_t        SPI3BRGSET __attribute__((section("sfrs"),address(0xBF847438)));
extern volatile uint32_t        SPI3BRGINV __attribute__((section("sfrs"),address(0xBF84743C)));
#define SPI3CON2 SPI3CON2
extern volatile uint32_t   SPI3CON2 __attribute__((section("sfrs"), address(0xBF847440)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI3CON2bits_t;
