Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpd064.h
extern volatile __ADCCMP2bits_t ADCCMP2bits __asm__ ("ADCCMP2") __attribute__((section("sfrs"), address(0xBF887110)));
extern volatile uint32_t        ADCCMP2CLR __attribute__((section("sfrs"),address(0xBF887114)));
extern volatile uint32_t        ADCCMP2SET __attribute__((section("sfrs"),address(0xBF887118)));
extern volatile uint32_t        ADCCMP2INV __attribute__((section("sfrs"),address(0xBF88711C)));
#define ADCCMPEN3 ADCCMPEN3
extern volatile uint32_t   ADCCMPEN3 __attribute__((section("sfrs"), address(0xBF887120)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t :4;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
} __ADCCMPEN3bits_t;
extern volatile __ADCCMPEN3bits_t ADCCMPEN3bits __asm__ ("ADCCMPEN3") __attribute__((section("sfrs"), address(0xBF887120)));
extern volatile uint32_t        ADCCMPEN3CLR __attribute__((section("sfrs"),address(0xBF887124)));
extern volatile uint32_t        ADCCMPEN3SET __attribute__((section("sfrs"),address(0xBF887128)));
extern volatile uint32_t        ADCCMPEN3INV __attribute__((section("sfrs"),address(0xBF88712C)));
#define ADCCMP3 ADCCMP3
extern volatile uint32_t   ADCCMP3 __attribute__((section("sfrs"), address(0xBF887130)));
typedef struct {
  uint32_t DCMPLO:16;
  uint32_t DCMPHI:16;
} __ADCCMP3bits_t;
extern volatile __ADCCMP3bits_t ADCCMP3bits __asm__ ("ADCCMP3") __attribute__((section("sfrs"), address(0xBF887130)));
extern volatile uint32_t        ADCCMP3CLR __attribute__((section("sfrs"),address(0xBF887134)));
extern volatile uint32_t        ADCCMP3SET __attribute__((section("sfrs"),address(0xBF887138)));
extern volatile uint32_t        ADCCMP3INV __attribute__((section("sfrs"),address(0xBF88713C)));
#define ADCCMPEN4 ADCCMPEN4
extern volatile uint32_t   ADCCMPEN4 __attribute__((section("sfrs"), address(0xBF887140)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t :4;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
} __ADCCMPEN4bits_t;
extern volatile __ADCCMPEN4bits_t ADCCMPEN4bits __asm__ ("ADCCMPEN4") __attribute__((section("sfrs"), address(0xBF887140)));
extern volatile uint32_t        ADCCMPEN4CLR __attribute__((section("sfrs"),address(0xBF887144)));
extern volatile uint32_t        ADCCMPEN4SET __attribute__((section("sfrs"),address(0xBF887148)));
extern volatile uint32_t        ADCCMPEN4INV __attribute__((section("sfrs"),address(0xBF88714C)));
#define ADCCMP4 ADCCMP4
extern volatile uint32_t   ADCCMP4 __attribute__((section("sfrs"), address(0xBF887150)));
typedef struct {
  uint32_t DCMPLO:16;
  uint32_t DCMPHI:16;
} __ADCCMP4bits_t;
extern volatile __ADCCMP4bits_t ADCCMP4bits __asm__ ("ADCCMP4") __attribute__((section("sfrs"), address(0xBF887150)));
extern volatile uint32_t        ADCCMP4CLR __attribute__((section("sfrs"),address(0xBF887154)));
extern volatile uint32_t        ADCCMP4SET __attribute__((section("sfrs"),address(0xBF887158)));
extern volatile uint32_t        ADCCMP4INV __attribute__((section("sfrs"),address(0xBF88715C)));
#define ADCFLTR1 ADCFLTR1
extern volatile uint32_t   ADCFLTR1 __attribute__((section("sfrs"), address(0xBF8871A0)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR1bits_t;
extern volatile __ADCFLTR1bits_t ADCFLTR1bits __asm__ ("ADCFLTR1") __attribute__((section("sfrs"), address(0xBF8871A0)));
extern volatile uint32_t        ADCFLTR1CLR __attribute__((section("sfrs"),address(0xBF8871A4)));
extern volatile uint32_t        ADCFLTR1SET __attribute__((section("sfrs"),address(0xBF8871A8)));
extern volatile uint32_t        ADCFLTR1INV __attribute__((section("sfrs"),address(0xBF8871AC)));
#define ADCFLTR2 ADCFLTR2
extern volatile uint32_t   ADCFLTR2 __attribute__((section("sfrs"), address(0xBF8871B0)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR2bits_t;
extern volatile __ADCFLTR2bits_t ADCFLTR2bits __asm__ ("ADCFLTR2") __attribute__((section("sfrs"), address(0xBF8871B0)));
extern volatile uint32_t        ADCFLTR2CLR __attribute__((section("sfrs"),address(0xBF8871B4)));
extern volatile uint32_t        ADCFLTR2SET __attribute__((section("sfrs"),address(0xBF8871B8)));
extern volatile uint32_t        ADCFLTR2INV __attribute__((section("sfrs"),address(0xBF8871BC)));
#define ADCFLTR3 ADCFLTR3
extern volatile uint32_t   ADCFLTR3 __attribute__((section("sfrs"), address(0xBF8871C0)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR3bits_t;
extern volatile __ADCFLTR3bits_t ADCFLTR3bits __asm__ ("ADCFLTR3") __attribute__((section("sfrs"), address(0xBF8871C0)));
extern volatile uint32_t        ADCFLTR3CLR __attribute__((section("sfrs"),address(0xBF8871C4)));
extern volatile uint32_t        ADCFLTR3SET __attribute__((section("sfrs"),address(0xBF8871C8)));
extern volatile uint32_t        ADCFLTR3INV __attribute__((section("sfrs"),address(0xBF8871CC)));
#define ADCFLTR4 ADCFLTR4
extern volatile uint32_t   ADCFLTR4 __attribute__((section("sfrs"), address(0xBF8871D0)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:5;
  uint32_t :3;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t DFMODE:1;
  uint32_t DATA16EN:1;
  uint32_t AFEN:1;
} __ADCFLTR4bits_t;
