Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpd064.h
extern volatile __U1EP2bits_t U1EP2bits __asm__ ("U1EP2") __attribute__((section("sfrs"), address(0xBF889320)));
extern volatile uint32_t        U1EP2CLR __attribute__((section("sfrs"),address(0xBF889324)));
extern volatile uint32_t        U1EP2SET __attribute__((section("sfrs"),address(0xBF889328)));
extern volatile uint32_t        U1EP2INV __attribute__((section("sfrs"),address(0xBF88932C)));
#define U1EP3 U1EP3
extern volatile uint32_t   U1EP3 __attribute__((section("sfrs"), address(0xBF889330)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP3bits_t;
extern volatile __U1EP3bits_t U1EP3bits __asm__ ("U1EP3") __attribute__((section("sfrs"), address(0xBF889330)));
extern volatile uint32_t        U1EP3CLR __attribute__((section("sfrs"),address(0xBF889334)));
extern volatile uint32_t        U1EP3SET __attribute__((section("sfrs"),address(0xBF889338)));
extern volatile uint32_t        U1EP3INV __attribute__((section("sfrs"),address(0xBF88933C)));
#define U1EP4 U1EP4
extern volatile uint32_t   U1EP4 __attribute__((section("sfrs"), address(0xBF889340)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP4bits_t;
extern volatile __U1EP4bits_t U1EP4bits __asm__ ("U1EP4") __attribute__((section("sfrs"), address(0xBF889340)));
extern volatile uint32_t        U1EP4CLR __attribute__((section("sfrs"),address(0xBF889344)));
extern volatile uint32_t        U1EP4SET __attribute__((section("sfrs"),address(0xBF889348)));
extern volatile uint32_t        U1EP4INV __attribute__((section("sfrs"),address(0xBF88934C)));
#define U1EP5 U1EP5
extern volatile uint32_t   U1EP5 __attribute__((section("sfrs"), address(0xBF889350)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP5bits_t;
extern volatile __U1EP5bits_t U1EP5bits __asm__ ("U1EP5") __attribute__((section("sfrs"), address(0xBF889350)));
extern volatile uint32_t        U1EP5CLR __attribute__((section("sfrs"),address(0xBF889354)));
extern volatile uint32_t        U1EP5SET __attribute__((section("sfrs"),address(0xBF889358)));
extern volatile uint32_t        U1EP5INV __attribute__((section("sfrs"),address(0xBF88935C)));
#define U1EP6 U1EP6
extern volatile uint32_t   U1EP6 __attribute__((section("sfrs"), address(0xBF889360)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP6bits_t;
extern volatile __U1EP6bits_t U1EP6bits __asm__ ("U1EP6") __attribute__((section("sfrs"), address(0xBF889360)));
extern volatile uint32_t        U1EP6CLR __attribute__((section("sfrs"),address(0xBF889364)));
extern volatile uint32_t        U1EP6SET __attribute__((section("sfrs"),address(0xBF889368)));
extern volatile uint32_t        U1EP6INV __attribute__((section("sfrs"),address(0xBF88936C)));
#define U1EP7 U1EP7
extern volatile uint32_t   U1EP7 __attribute__((section("sfrs"), address(0xBF889370)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP7bits_t;
extern volatile __U1EP7bits_t U1EP7bits __asm__ ("U1EP7") __attribute__((section("sfrs"), address(0xBF889370)));
extern volatile uint32_t        U1EP7CLR __attribute__((section("sfrs"),address(0xBF889374)));
extern volatile uint32_t        U1EP7SET __attribute__((section("sfrs"),address(0xBF889378)));
extern volatile uint32_t        U1EP7INV __attribute__((section("sfrs"),address(0xBF88937C)));
#define U1EP8 U1EP8
extern volatile uint32_t   U1EP8 __attribute__((section("sfrs"), address(0xBF889380)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP8bits_t;
extern volatile __U1EP8bits_t U1EP8bits __asm__ ("U1EP8") __attribute__((section("sfrs"), address(0xBF889380)));
extern volatile uint32_t        U1EP8CLR __attribute__((section("sfrs"),address(0xBF889384)));
extern volatile uint32_t        U1EP8SET __attribute__((section("sfrs"),address(0xBF889388)));
extern volatile uint32_t        U1EP8INV __attribute__((section("sfrs"),address(0xBF88938C)));
#define U1EP9 U1EP9
extern volatile uint32_t   U1EP9 __attribute__((section("sfrs"), address(0xBF889390)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP9bits_t;
extern volatile __U1EP9bits_t U1EP9bits __asm__ ("U1EP9") __attribute__((section("sfrs"), address(0xBF889390)));
extern volatile uint32_t        U1EP9CLR __attribute__((section("sfrs"),address(0xBF889394)));
extern volatile uint32_t        U1EP9SET __attribute__((section("sfrs"),address(0xBF889398)));
extern volatile uint32_t        U1EP9INV __attribute__((section("sfrs"),address(0xBF88939C)));
#define U1EP10 U1EP10
extern volatile uint32_t   U1EP10 __attribute__((section("sfrs"), address(0xBF8893A0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP10bits_t;
extern volatile __U1EP10bits_t U1EP10bits __asm__ ("U1EP10") __attribute__((section("sfrs"), address(0xBF8893A0)));
extern volatile uint32_t        U1EP10CLR __attribute__((section("sfrs"),address(0xBF8893A4)));
extern volatile uint32_t        U1EP10SET __attribute__((section("sfrs"),address(0xBF8893A8)));
extern volatile uint32_t        U1EP10INV __attribute__((section("sfrs"),address(0xBF8893AC)));
#define U1EP11 U1EP11
extern volatile uint32_t   U1EP11 __attribute__((section("sfrs"), address(0xBF8893B0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP11bits_t;
extern volatile __U1EP11bits_t U1EP11bits __asm__ ("U1EP11") __attribute__((section("sfrs"), address(0xBF8893B0)));
extern volatile uint32_t        U1EP11CLR __attribute__((section("sfrs"),address(0xBF8893B4)));
extern volatile uint32_t        U1EP11SET __attribute__((section("sfrs"),address(0xBF8893B8)));
extern volatile uint32_t        U1EP11INV __attribute__((section("sfrs"),address(0xBF8893BC)));
#define U1EP12 U1EP12
extern volatile uint32_t   U1EP12 __attribute__((section("sfrs"), address(0xBF8893C0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP12bits_t;
extern volatile __U1EP12bits_t U1EP12bits __asm__ ("U1EP12") __attribute__((section("sfrs"), address(0xBF8893C0)));
extern volatile uint32_t        U1EP12CLR __attribute__((section("sfrs"),address(0xBF8893C4)));
extern volatile uint32_t        U1EP12SET __attribute__((section("sfrs"),address(0xBF8893C8)));
extern volatile uint32_t        U1EP12INV __attribute__((section("sfrs"),address(0xBF8893CC)));
#define U1EP13 U1EP13
extern volatile uint32_t   U1EP13 __attribute__((section("sfrs"), address(0xBF8893D0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP13bits_t;
extern volatile __U1EP13bits_t U1EP13bits __asm__ ("U1EP13") __attribute__((section("sfrs"), address(0xBF8893D0)));
extern volatile uint32_t        U1EP13CLR __attribute__((section("sfrs"),address(0xBF8893D4)));
extern volatile uint32_t        U1EP13SET __attribute__((section("sfrs"),address(0xBF8893D8)));
extern volatile uint32_t        U1EP13INV __attribute__((section("sfrs"),address(0xBF8893DC)));
#define U1EP14 U1EP14
extern volatile uint32_t   U1EP14 __attribute__((section("sfrs"), address(0xBF8893E0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP14bits_t;
extern volatile __U1EP14bits_t U1EP14bits __asm__ ("U1EP14") __attribute__((section("sfrs"), address(0xBF8893E0)));
extern volatile uint32_t        U1EP14CLR __attribute__((section("sfrs"),address(0xBF8893E4)));
extern volatile uint32_t        U1EP14SET __attribute__((section("sfrs"),address(0xBF8893E8)));
extern volatile uint32_t        U1EP14INV __attribute__((section("sfrs"),address(0xBF8893EC)));
#define U1EP15 U1EP15
extern volatile uint32_t   U1EP15 __attribute__((section("sfrs"), address(0xBF8893F0)));
typedef struct {
  uint32_t EPHSHK:1;
  uint32_t EPSTALL:1;
  uint32_t EPTXEN:1;
  uint32_t EPRXEN:1;
  uint32_t EPCONDIS:1;
} __U1EP15bits_t;
