Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpd064.h
  .extern ADC1TIMECLR      /* 0xBF887364 */
  .extern ADC1TIMESET      /* 0xBF887368 */
  .extern ADC1TIMEINV      /* 0xBF88736C */
  .extern ADC2TIME         /* 0xBF887370 */
  .extern ADC2TIMECLR      /* 0xBF887374 */
  .extern ADC2TIMESET      /* 0xBF887378 */
  .extern ADC2TIMEINV      /* 0xBF88737C */
  .extern ADC3TIME         /* 0xBF887380 */
  .extern ADC3TIMECLR      /* 0xBF887384 */
  .extern ADC3TIMESET      /* 0xBF887388 */
  .extern ADC3TIMEINV      /* 0xBF88738C */
  .extern ADC4TIME         /* 0xBF887390 */
  .extern ADC4TIMECLR      /* 0xBF887394 */
  .extern ADC4TIMESET      /* 0xBF887398 */
  .extern ADC4TIMEINV      /* 0xBF88739C */
  .extern ADC5TIME         /* 0xBF8873A0 */
  .extern ADC5TIMECLR      /* 0xBF8873A4 */
  .extern ADC5TIMESET      /* 0xBF8873A8 */
  .extern ADC5TIMEINV      /* 0xBF8873AC */
  .extern ADCEIEN1         /* 0xBF8873C0 */
  .extern ADCEIEN1CLR      /* 0xBF8873C4 */
  .extern ADCEIEN1SET      /* 0xBF8873C8 */
  .extern ADCEIEN1INV      /* 0xBF8873CC */
  .extern ADCEIEN2         /* 0xBF8873D0 */
  .extern ADCEIEN2CLR      /* 0xBF8873D4 */
  .extern ADCEIEN2SET      /* 0xBF8873D8 */
  .extern ADCEIEN2INV      /* 0xBF8873DC */
  .extern ADCEISTAT1       /* 0xBF8873E0 */
  .extern ADCEISTAT1CLR    /* 0xBF8873E4 */
  .extern ADCEISTAT1SET    /* 0xBF8873E8 */
  .extern ADCEISTAT1INV    /* 0xBF8873EC */
  .extern ADCEISTAT2       /* 0xBF8873F0 */
  .extern ADCEISTAT2CLR    /* 0xBF8873F4 */
  .extern ADCEISTAT2SET    /* 0xBF8873F8 */
  .extern ADCEISTAT2INV    /* 0xBF8873FC */
  .extern ADCANCON         /* 0xBF887400 */
  .extern ADCANCONCLR      /* 0xBF887404 */
  .extern ADCANCONSET      /* 0xBF887408 */
  .extern ADCANCONINV      /* 0xBF88740C */
  .extern ADCDATA0         /* 0xBF887600 */
  .extern ADCDATA0CLR      /* 0xBF887604 */
  .extern ADCDATA0SET      /* 0xBF887608 */
  .extern ADCDATA0INV      /* 0xBF88760C */
  .extern ADCDATA1         /* 0xBF887610 */
  .extern ADCDATA1CLR      /* 0xBF887614 */
  .extern ADCDATA1SET      /* 0xBF887618 */
  .extern ADCDATA1INV      /* 0xBF88761C */
  .extern ADCDATA2         /* 0xBF887620 */
  .extern ADCDATA2CLR      /* 0xBF887624 */
  .extern ADCDATA2SET      /* 0xBF887628 */
  .extern ADCDATA2INV      /* 0xBF88762C */
  .extern ADCDATA3         /* 0xBF887630 */
  .extern ADCDATA3CLR      /* 0xBF887634 */
  .extern ADCDATA3SET      /* 0xBF887638 */
  .extern ADCDATA3INV      /* 0xBF88763C */
  .extern ADCDATA4         /* 0xBF887640 */
  .extern ADCDATA4CLR      /* 0xBF887644 */
  .extern ADCDATA4SET      /* 0xBF887648 */
  .extern ADCDATA4INV      /* 0xBF88764C */
  .extern ADCDATA5         /* 0xBF887650 */
  .extern ADCDATA5CLR      /* 0xBF887654 */
  .extern ADCDATA5SET      /* 0xBF887658 */
  .extern ADCDATA5INV      /* 0xBF88765C */
  .extern ADCDATA6         /* 0xBF887660 */
  .extern ADCDATA6CLR      /* 0xBF887664 */
  .extern ADCDATA6SET      /* 0xBF887668 */
  .extern ADCDATA6INV      /* 0xBF88766C */
  .extern ADCDATA7         /* 0xBF887670 */
  .extern ADCDATA7CLR      /* 0xBF887674 */
  .extern ADCDATA7SET      /* 0xBF887678 */
  .extern ADCDATA7INV      /* 0xBF88767C */
  .extern ADCDATA8         /* 0xBF887680 */
  .extern ADCDATA8CLR      /* 0xBF887684 */
  .extern ADCDATA8SET      /* 0xBF887688 */
  .extern ADCDATA8INV      /* 0xBF88768C */
  .extern ADCDATA9         /* 0xBF887690 */
  .extern ADCDATA9CLR      /* 0xBF887694 */
  .extern ADCDATA9SET      /* 0xBF887698 */
  .extern ADCDATA9INV      /* 0xBF88769C */
  .extern ADCDATA10        /* 0xBF8876A0 */
  .extern ADCDATA10CLR     /* 0xBF8876A4 */
  .extern ADCDATA10SET     /* 0xBF8876A8 */
  .extern ADCDATA10INV     /* 0xBF8876AC */
  .extern ADCDATA11        /* 0xBF8876B0 */
  .extern ADCDATA11CLR     /* 0xBF8876B4 */
  .extern ADCDATA11SET     /* 0xBF8876B8 */
  .extern ADCDATA11INV     /* 0xBF8876BC */
  .extern ADCDATA12        /* 0xBF8876C0 */
  .extern ADCDATA12CLR     /* 0xBF8876C4 */
  .extern ADCDATA12SET     /* 0xBF8876C8 */
  .extern ADCDATA12INV     /* 0xBF8876CC */
  .extern ADCDATA13        /* 0xBF8876D0 */
  .extern ADCDATA13CLR     /* 0xBF8876D4 */
  .extern ADCDATA13SET     /* 0xBF8876D8 */
  .extern ADCDATA13INV     /* 0xBF8876DC */
  .extern ADCDATA14        /* 0xBF8876E0 */
  .extern ADCDATA14CLR     /* 0xBF8876E4 */
  .extern ADCDATA14SET     /* 0xBF8876E8 */
  .extern ADCDATA14INV     /* 0xBF8876EC */
  .extern ADCDATA15        /* 0xBF8876F0 */
  .extern ADCDATA15CLR     /* 0xBF8876F4 */
  .extern ADCDATA15SET     /* 0xBF8876F8 */
  .extern ADCDATA15INV     /* 0xBF8876FC */
  .extern ADCDATA16        /* 0xBF887700 */
  .extern ADCDATA16CLR     /* 0xBF887704 */
  .extern ADCDATA16SET     /* 0xBF887708 */
  .extern ADCDATA16INV     /* 0xBF88770C */
  .extern ADCDATA17        /* 0xBF887710 */
  .extern ADCDATA17CLR     /* 0xBF887714 */
  .extern ADCDATA17SET     /* 0xBF887718 */
  .extern ADCDATA17INV     /* 0xBF88771C */
  .extern ADCDATA18        /* 0xBF887720 */
  .extern ADCDATA18CLR     /* 0xBF887724 */
  .extern ADCDATA18SET     /* 0xBF887728 */
  .extern ADCDATA18INV     /* 0xBF88772C */
  .extern ADCDATA19        /* 0xBF887730 */
  .extern ADCDATA19CLR     /* 0xBF887734 */
  .extern ADCDATA19SET     /* 0xBF887738 */
  .extern ADCDATA19INV     /* 0xBF88773C */
  .extern ADCDATA24        /* 0xBF887780 */
  .extern ADCDATA24CLR     /* 0xBF887784 */
  .extern ADCDATA24SET     /* 0xBF887788 */
  .extern ADCDATA24INV     /* 0xBF88778C */
  .extern ADCDATA25        /* 0xBF887790 */
  .extern ADCDATA25CLR     /* 0xBF887794 */
  .extern ADCDATA25SET     /* 0xBF887798 */
  .extern ADCDATA25INV     /* 0xBF88779C */
  .extern ADCDATA26        /* 0xBF8877A0 */
  .extern ADCDATA26CLR     /* 0xBF8877A4 */
  .extern ADCDATA26SET     /* 0xBF8877A8 */
  .extern ADCDATA26INV     /* 0xBF8877AC */
  .extern ADCDATA27        /* 0xBF8877B0 */
  .extern ADCDATA27CLR     /* 0xBF8877B4 */
  .extern ADCDATA27SET     /* 0xBF8877B8 */
  .extern ADCDATA27INV     /* 0xBF8877BC */
  .extern ADCDATA48        /* 0xBF887900 */
  .extern ADCDATA48CLR     /* 0xBF887904 */
  .extern ADCDATA48SET     /* 0xBF887908 */
  .extern ADCDATA48INV     /* 0xBF88790C */
  .extern ADCDATA49        /* 0xBF887910 */
  .extern ADCDATA49CLR     /* 0xBF887914 */
  .extern ADCDATA49SET     /* 0xBF887918 */
  .extern ADCDATA49INV     /* 0xBF88791C */
  .extern ADCDATA50        /* 0xBF887920 */
  .extern ADCDATA50CLR     /* 0xBF887924 */
  .extern ADCDATA50SET     /* 0xBF887928 */
  .extern ADCDATA50INV     /* 0xBF88792C */
  .extern ADCDATA51        /* 0xBF887930 */
  .extern ADCDATA51CLR     /* 0xBF887934 */
  .extern ADCDATA51SET     /* 0xBF887938 */
  .extern ADCDATA51INV     /* 0xBF88793C */
  .extern ADCDATA52        /* 0xBF887940 */
  .extern ADCDATA52CLR     /* 0xBF887944 */
  .extern ADCDATA52SET     /* 0xBF887948 */
  .extern ADCDATA52INV     /* 0xBF88794C */
  .extern ADCDATA53        /* 0xBF887950 */
  .extern ADCDATA53CLR     /* 0xBF887954 */
  .extern ADCDATA53SET     /* 0xBF887958 */
  .extern ADCDATA53INV     /* 0xBF88795C */
  .extern ADC0CFG          /* 0xBF887D00 */
  .extern ADC0CFGCLR       /* 0xBF887D04 */
  .extern ADC0CFGSET       /* 0xBF887D08 */
  .extern ADC0CFGINV       /* 0xBF887D0C */
  .extern ADC1CFG          /* 0xBF887D10 */
  .extern ADC1CFGCLR       /* 0xBF887D14 */
  .extern ADC1CFGSET       /* 0xBF887D18 */
  .extern ADC1CFGINV       /* 0xBF887D1C */
  .extern ADC2CFG          /* 0xBF887D20 */
  .extern ADC2CFGCLR       /* 0xBF887D24 */
  .extern ADC2CFGSET       /* 0xBF887D28 */
  .extern ADC2CFGINV       /* 0xBF887D2C */
  .extern ADC3CFG          /* 0xBF887D30 */
  .extern ADC3CFGCLR       /* 0xBF887D34 */
  .extern ADC3CFGSET       /* 0xBF887D38 */
  .extern ADC3CFGINV       /* 0xBF887D3C */
  .extern ADC4CFG          /* 0xBF887D40 */
  .extern ADC4CFGCLR       /* 0xBF887D44 */
  .extern ADC4CFGSET       /* 0xBF887D48 */
  .extern ADC4CFGINV       /* 0xBF887D4C */
  .extern ADC5CFG          /* 0xBF887D50 */
  .extern ADC5CFGCLR       /* 0xBF887D54 */
  .extern ADC5CFGSET       /* 0xBF887D58 */
  .extern ADC5CFGINV       /* 0xBF887D5C */
  .extern ADC7CFG          /* 0xBF887D70 */
  .extern ADC7CFGCLR       /* 0xBF887D74 */
  .extern ADC7CFGSET       /* 0xBF887D78 */
  .extern ADC7CFGINV       /* 0xBF887D7C */
  .extern ADCSYSCFG0       /* 0xBF887E00 */
  .extern ADCSYSCFG0CLR    /* 0xBF887E04 */
  .extern ADCSYSCFG0SET    /* 0xBF887E08 */
  .extern ADCSYSCFG0INV    /* 0xBF887E0C */
  .extern ADCSYSCFG1       /* 0xBF887E10 */
  .extern ADCSYSCFG1CLR    /* 0xBF887E14 */
  .extern ADCSYSCFG1SET    /* 0xBF887E18 */
  .extern ADCSYSCFG1INV    /* 0xBF887E1C */
  .extern U1OTGIR          /* 0xBF889040 */
  .extern U1OTGIRCLR       /* 0xBF889044 */
  .extern U1OTGIE          /* 0xBF889050 */
  .extern U1OTGIECLR       /* 0xBF889054 */
  .extern U1OTGIESET       /* 0xBF889058 */
  .extern U1OTGIEINV       /* 0xBF88905C */
  .extern U1OTGSTAT        /* 0xBF889060 */
  .extern U1OTGCON         /* 0xBF889070 */
  .extern U1OTGCONCLR      /* 0xBF889074 */
  .extern U1OTGCONSET      /* 0xBF889078 */
  .extern U1OTGCONINV      /* 0xBF88907C */
  .extern U1PWRC           /* 0xBF889080 */
  .extern U1PWRCCLR        /* 0xBF889084 */
  .extern U1PWRCSET        /* 0xBF889088 */
  .extern U1PWRCINV        /* 0xBF88908C */
  .extern U1IR             /* 0xBF889200 */
  .extern U1IRCLR          /* 0xBF889204 */
  .extern U1IE             /* 0xBF889210 */
  .extern U1IECLR          /* 0xBF889214 */
  .extern U1IESET          /* 0xBF889218 */
  .extern U1IEINV          /* 0xBF88921C */
  .extern U1EIR            /* 0xBF889220 */
  .extern U1EIRCLR         /* 0xBF889224 */
  .extern U1EIE            /* 0xBF889230 */
  .extern U1EIECLR         /* 0xBF889234 */
  .extern U1EIESET         /* 0xBF889238 */
  .extern U1EIEINV         /* 0xBF88923C */
  .extern U1STAT           /* 0xBF889240 */
  .extern U1CON            /* 0xBF889250 */
  .extern U1CONCLR         /* 0xBF889254 */
  .extern U1CONSET         /* 0xBF889258 */
  .extern U1CONINV         /* 0xBF88925C */
  .extern U1ADDR           /* 0xBF889260 */
  .extern U1ADDRCLR        /* 0xBF889264 */
  .extern U1ADDRSET        /* 0xBF889268 */
  .extern U1ADDRINV        /* 0xBF88926C */
  .extern U1BDTP1          /* 0xBF889270 */
  .extern U1BDTP1CLR       /* 0xBF889274 */
  .extern U1BDTP1SET       /* 0xBF889278 */
  .extern U1BDTP1INV       /* 0xBF88927C */
  .extern U1FRML           /* 0xBF889280 */
  .extern U1FRMH           /* 0xBF889290 */
  .extern U1TOK            /* 0xBF8892A0 */
  .extern U1TOKCLR         /* 0xBF8892A4 */
  .extern U1TOKSET         /* 0xBF8892A8 */
  .extern U1TOKINV         /* 0xBF8892AC */
  .extern U1SOF            /* 0xBF8892B0 */
  .extern U1SOFCLR         /* 0xBF8892B4 */
  .extern U1SOFSET         /* 0xBF8892B8 */
  .extern U1SOFINV         /* 0xBF8892BC */
  .extern U1BDTP2          /* 0xBF8892C0 */
  .extern U1BDTP2CLR       /* 0xBF8892C4 */
  .extern U1BDTP2SET       /* 0xBF8892C8 */
  .extern U1BDTP2INV       /* 0xBF8892CC */
  .extern U1BDTP3          /* 0xBF8892D0 */
  .extern U1BDTP3CLR       /* 0xBF8892D4 */
  .extern U1BDTP3SET       /* 0xBF8892D8 */
  .extern U1BDTP3INV       /* 0xBF8892DC */
  .extern U1CNFG1          /* 0xBF8892E0 */
  .extern U1CNFG1CLR       /* 0xBF8892E4 */
  .extern U1CNFG1SET       /* 0xBF8892E8 */
  .extern U1CNFG1INV       /* 0xBF8892EC */
  .extern U1EP0            /* 0xBF889300 */
  .extern U1EP0CLR         /* 0xBF889304 */
  .extern U1EP0SET         /* 0xBF889308 */
  .extern U1EP0INV         /* 0xBF88930C */
  .extern U1EP1            /* 0xBF889310 */
  .extern U1EP1CLR         /* 0xBF889314 */
  .extern U1EP1SET         /* 0xBF889318 */
  .extern U1EP1INV         /* 0xBF88931C */
  .extern U1EP2            /* 0xBF889320 */
  .extern U1EP2CLR         /* 0xBF889324 */
  .extern U1EP2SET         /* 0xBF889328 */
  .extern U1EP2INV         /* 0xBF88932C */
  .extern U1EP3            /* 0xBF889330 */
  .extern U1EP3CLR         /* 0xBF889334 */
  .extern U1EP3SET         /* 0xBF889338 */
  .extern U1EP3INV         /* 0xBF88933C */
  .extern U1EP4            /* 0xBF889340 */
  .extern U1EP4CLR         /* 0xBF889344 */
  .extern U1EP4SET         /* 0xBF889348 */
  .extern U1EP4INV         /* 0xBF88934C */
  .extern U1EP5            /* 0xBF889350 */
  .extern U1EP5CLR         /* 0xBF889354 */
  .extern U1EP5SET         /* 0xBF889358 */
  .extern U1EP5INV         /* 0xBF88935C */
  .extern U1EP6            /* 0xBF889360 */
  .extern U1EP6CLR         /* 0xBF889364 */
  .extern U1EP6SET         /* 0xBF889368 */
  .extern U1EP6INV         /* 0xBF88936C */
  .extern U1EP7            /* 0xBF889370 */
  .extern U1EP7CLR         /* 0xBF889374 */
  .extern U1EP7SET         /* 0xBF889378 */
  .extern U1EP7INV         /* 0xBF88937C */
  .extern U1EP8            /* 0xBF889380 */
  .extern U1EP8CLR         /* 0xBF889384 */
  .extern U1EP8SET         /* 0xBF889388 */
  .extern U1EP8INV         /* 0xBF88938C */
  .extern U1EP9            /* 0xBF889390 */
  .extern U1EP9CLR         /* 0xBF889394 */
  .extern U1EP9SET         /* 0xBF889398 */
  .extern U1EP9INV         /* 0xBF88939C */
  .extern U1EP10           /* 0xBF8893A0 */
  .extern U1EP10CLR        /* 0xBF8893A4 */
  .extern U1EP10SET        /* 0xBF8893A8 */
  .extern U1EP10INV        /* 0xBF8893AC */
  .extern U1EP11           /* 0xBF8893B0 */
  .extern U1EP11CLR        /* 0xBF8893B4 */
  .extern U1EP11SET        /* 0xBF8893B8 */
  .extern U1EP11INV        /* 0xBF8893BC */
  .extern U1EP12           /* 0xBF8893C0 */
  .extern U1EP12CLR        /* 0xBF8893C4 */
  .extern U1EP12SET        /* 0xBF8893C8 */
  .extern U1EP12INV        /* 0xBF8893CC */
  .extern U1EP13           /* 0xBF8893D0 */
  .extern U1EP13CLR        /* 0xBF8893D4 */
  .extern U1EP13SET        /* 0xBF8893D8 */
  .extern U1EP13INV        /* 0xBF8893DC */
  .extern U1EP14           /* 0xBF8893E0 */
  .extern U1EP14CLR        /* 0xBF8893E4 */
  .extern U1EP14SET        /* 0xBF8893E8 */
  .extern U1EP14INV        /* 0xBF8893EC */
  .extern U1EP15           /* 0xBF8893F0 */
  .extern U1EP15CLR        /* 0xBF8893F4 */
  .extern U1EP15SET        /* 0xBF8893F8 */
  .extern U1EP15INV        /* 0xBF8893FC */
  .extern RTCCON           /* 0xBF8C0000 */
  .extern RTCCONCLR        /* 0xBF8C0004 */
  .extern RTCCONSET        /* 0xBF8C0008 */
  .extern RTCCONINV        /* 0xBF8C000C */
  .extern RTCALRM          /* 0xBF8C0010 */
  .extern RTCALRMCLR       /* 0xBF8C0014 */
  .extern RTCALRMSET       /* 0xBF8C0018 */
  .extern RTCALRMINV       /* 0xBF8C001C */
  .extern RTCTIME          /* 0xBF8C0020 */
  .extern RTCTIMECLR       /* 0xBF8C0024 */
  .extern RTCTIMESET       /* 0xBF8C0028 */
  .extern RTCTIMEINV       /* 0xBF8C002C */
  .extern RTCDATE          /* 0xBF8C0030 */
  .extern RTCDATECLR       /* 0xBF8C0034 */
  .extern RTCDATESET       /* 0xBF8C0038 */
  .extern RTCDATEINV       /* 0xBF8C003C */
  .extern ALRMTIME         /* 0xBF8C0040 */
  .extern ALRMTIMECLR      /* 0xBF8C0044 */
  .extern ALRMTIMESET      /* 0xBF8C0048 */
  .extern ALRMTIMEINV      /* 0xBF8C004C */
  .extern ALRMDATE         /* 0xBF8C0050 */
  .extern ALRMDATECLR      /* 0xBF8C0054 */
  .extern ALRMDATESET      /* 0xBF8C0058 */
  .extern ALRMDATEINV      /* 0xBF8C005C */
  .extern DSCON            /* 0xBF8C0200 */
  .extern DSWAKE           /* 0xBF8C0204 */
  .extern DSGPR0           /* 0xBF8C0208 */
  .extern DSGPR1           /* 0xBF8C0210 */
  .extern DSGPR2           /* 0xBF8C0214 */
  .extern DSGPR3           /* 0xBF8C0218 */
  .extern DSGPR4           /* 0xBF8C021C */
  .extern DSGPR5           /* 0xBF8C0220 */
  .extern DSGPR6           /* 0xBF8C0224 */
  .extern DSGPR7           /* 0xBF8C0228 */
  .extern DSGPR8           /* 0xBF8C022C */
  .extern DSGPR9           /* 0xBF8C0230 */
  .extern DSGPR10          /* 0xBF8C0234 */
  .extern DSGPR11          /* 0xBF8C0238 */
  .extern DSGPR12          /* 0xBF8C023C */
  .extern DSGPR13          /* 0xBF8C0240 */
  .extern DSGPR14          /* 0xBF8C0244 */
  .extern DSGPR15          /* 0xBF8C0248 */
  .extern DSGPR16          /* 0xBF8C024C */
  .extern DSGPR17          /* 0xBF8C0250 */
  .extern DSGPR18          /* 0xBF8C0254 */
  .extern DSGPR19          /* 0xBF8C0258 */
  .extern DSGPR20          /* 0xBF8C025C */
  .extern DSGPR21          /* 0xBF8C0260 */
  .extern DSGPR22          /* 0xBF8C0264 */
  .extern DSGPR23          /* 0xBF8C0268 */
  .extern DSGPR24          /* 0xBF8C026C */
  .extern DSGPR25          /* 0xBF8C0270 */
  .extern DSGPR26          /* 0xBF8C0274 */
  .extern DSGPR27          /* 0xBF8C0278 */
  .extern DSGPR28          /* 0xBF8C027C */
  .extern DSGPR29          /* 0xBF8C0280 */
  .extern DSGPR30          /* 0xBF8C0284 */
  .extern DSGPR31          /* 0xBF8C0288 */
  .extern DSGPR32          /* 0xBF8C028C */
  .extern SBFLAG           /* 0xBF8F0510 */
  .extern SBT0ELOG1        /* 0xBF8F8020 */
  .extern SBT0ELOG2        /* 0xBF8F8024 */
  .extern SBT0ECON         /* 0xBF8F8028 */
  .extern SBT0ECLRS        /* 0xBF8F8030 */
  .extern SBT0ECLRM        /* 0xBF8F8038 */
  .extern SBT0REG0         /* 0xBF8F8040 */
  .extern SBT0RD0          /* 0xBF8F8050 */
  .extern SBT0WR0          /* 0xBF8F8058 */
  .extern SBT0REG1         /* 0xBF8F8060 */
  .extern SBT0RD1          /* 0xBF8F8070 */
  .extern SBT0WR1          /* 0xBF8F8078 */
  .extern SBT1ELOG1        /* 0xBF8F8420 */
  .extern SBT1ELOG2        /* 0xBF8F8424 */
  .extern SBT1ECON         /* 0xBF8F8428 */
  .extern SBT1ECLRS        /* 0xBF8F8430 */
  .extern SBT1ECLRM        /* 0xBF8F8438 */
  .extern SBT1REG0         /* 0xBF8F8440 */
  .extern SBT1RD0          /* 0xBF8F8450 */
  .extern SBT1WR0          /* 0xBF8F8458 */
  .extern SBT1REG2         /* 0xBF8F8480 */
  .extern SBT1RD2          /* 0xBF8F8490 */
  .extern SBT1WR2          /* 0xBF8F8498 */
  .extern SBT1REG3         /* 0xBF8F84A0 */
  .extern SBT1RD3          /* 0xBF8F84B0 */
  .extern SBT1WR3          /* 0xBF8F84B8 */
  .extern SBT1REG4         /* 0xBF8F84C0 */
  .extern SBT1RD4          /* 0xBF8F84D0 */
  .extern SBT1WR4          /* 0xBF8F84D8 */
  .extern SBT1REG5         /* 0xBF8F84E0 */
  .extern SBT1RD5          /* 0xBF8F84F0 */
  .extern SBT1WR5          /* 0xBF8F84F8 */
  .extern SBT1REG6         /* 0xBF8F8500 */
  .extern SBT1RD6          /* 0xBF8F8510 */
  .extern SBT1WR6          /* 0xBF8F8518 */
  .extern SBT1REG7         /* 0xBF8F8520 */
  .extern SBT1RD7          /* 0xBF8F8530 */
  .extern SBT1WR7          /* 0xBF8F8538 */
  .extern SBT1REG8         /* 0xBF8F8540 */
  .extern SBT1RD8          /* 0xBF8F8550 */
  .extern SBT1WR8          /* 0xBF8F8558 */
  .extern SBT2ELOG1        /* 0xBF8F8820 */
  .extern SBT2ELOG2        /* 0xBF8F8824 */
  .extern SBT2ECON         /* 0xBF8F8828 */
  .extern SBT2ECLRS        /* 0xBF8F8830 */
  .extern SBT2ECLRM        /* 0xBF8F8838 */
  .extern SBT2REG0         /* 0xBF8F8840 */
  .extern SBT2RD0          /* 0xBF8F8850 */
  .extern SBT2WR0          /* 0xBF8F8858 */
  .extern SBT2REG1         /* 0xBF8F8860 */
  .extern SBT2RD1          /* 0xBF8F8870 */
  .extern SBT2WR1          /* 0xBF8F8878 */
  .extern SBT2REG2         /* 0xBF8F8880 */
  .extern SBT2RD2          /* 0xBF8F8890 */
  .extern SBT2WR2          /* 0xBF8F8898 */
  .extern SBT3ELOG1        /* 0xBF8F8C20 */
  .extern SBT3ELOG2        /* 0xBF8F8C24 */
  .extern SBT3ECON         /* 0xBF8F8C28 */
  .extern SBT3ECLRS        /* 0xBF8F8C30 */
  .extern SBT3ECLRM        /* 0xBF8F8C38 */
  .extern SBT3REG0         /* 0xBF8F8C40 */
  .extern SBT3RD0          /* 0xBF8F8C50 */
  .extern SBT3WR0          /* 0xBF8F8C58 */
  .extern SBT3REG1         /* 0xBF8F8C60 */
  .extern SBT3RD1          /* 0xBF8F8C70 */
  .extern SBT3WR1          /* 0xBF8F8C78 */
  .extern SBT3REG2         /* 0xBF8F8C80 */
  .extern SBT3RD2          /* 0xBF8F8C90 */
  .extern SBT3WR2          /* 0xBF8F8C98 */
  .extern DEVCFG3          /* 0xBFC03FC0 */
  .extern DEVCFG2          /* 0xBFC03FC4 */
  .extern DEVCFG1          /* 0xBFC03FC8 */
  .extern DEVCFG0          /* 0xBFC03FCC */
  .extern DEVCP            /* 0xBFC03FDC */
  .extern DEVSIGN          /* 0xBFC03FEC */
  .extern SEQ              /* 0xBFC03FF0 */
  .extern DEVADC0          /* 0xBFC45000 */
  .extern DEVADC1          /* 0xBFC45004 */
  .extern DEVADC2          /* 0xBFC45008 */
  .extern DEVADC3          /* 0xBFC4500C */
  .extern DEVADC4          /* 0xBFC45010 */
  .extern DEVADC5          /* 0xBFC45014 */
  .extern DEVADC7          /* 0xBFC45018 */
  .extern DEVSN0           /* 0xBFC45020 */
  .extern DEVSN1           /* 0xBFC45024 */
  .extern DEVSN2           /* 0xBFC45028 */
  .extern DEVSN3           /* 0xBFC4502C */
  .extern DEVEE0           /* 0xBFC45030 */
  .extern DEVEE1           /* 0xBFC45034 */
  .extern DEVEE2           /* 0xBFC45038 */
  .extern DEVEE3           /* 0xBFC4503C */
  .extern UBADEVCFG3       /* 0xBFC23FC0 */
  .extern UBADEVCFG2       /* 0xBFC23FC4 */
  .extern UBADEVCFG1       /* 0xBFC23FC8 */
  .extern UBADEVCFG0       /* 0xBFC23FCC */
  .extern UBADEVCP         /* 0xBFC23FDC */
  .extern UBADEVSIGN       /* 0xBFC23FEC */
  .extern UBASEQ           /* 0xBFC23FF0 */
  .extern BF1DEVCFG3       /* 0xBFC43FC0 */
  .extern BF1DEVCFG2       /* 0xBFC43FC4 */
  .extern BF1DEVCFG1       /* 0xBFC43FC8 */
  .extern BF1DEVCFG0       /* 0xBFC43FCC */
  .extern BF1DEVCP         /* 0xBFC43FDC */
  .extern BF1DEVSIGN       /* 0xBFC43FEC */
  .extern BF1SEQ           /* 0xBFC43FF0 */
  .extern BF2DEVCFG3       /* 0xBFC63FC0 */
  .extern BF2DEVCFG2       /* 0xBFC63FC4 */
  .extern BF2DEVCFG1       /* 0xBFC63FC8 */
  .extern BF2DEVCFG0       /* 0xBFC63FCC */
  .extern BF2DEVCP         /* 0xBFC63FDC */
  .extern BF2DEVSIGN       /* 0xBFC63FEC */
  .extern BF2SEQ           /* 0xBFC63FF0 */
#else
#error Unknown language!
#endif

#define _CFGCON_TDOEN_POSITION                   0x00000000
#define _CFGCON_TDOEN_MASK                       0x00000001
#define _CFGCON_TDOEN_LENGTH                     0x00000001

#define _CFGCON_TROEN_POSITION                   0x00000002
#define _CFGCON_TROEN_MASK                       0x00000004
#define _CFGCON_TROEN_LENGTH                     0x00000001

#define _CFGCON_JTAGEN_POSITION                  0x00000003
#define _CFGCON_JTAGEN_MASK                      0x00000008
#define _CFGCON_JTAGEN_LENGTH                    0x00000001

#define _CFGCON_IOANCPEN_POSITION                0x00000007
#define _CFGCON_IOANCPEN_MASK                    0x00000080
#define _CFGCON_IOANCPEN_LENGTH                  0x00000001

