Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpd064.h
#define _IFS4_AD1D25IF_POSITION                  0x00000003
#define _IFS4_AD1D25IF_MASK                      0x00000008
#define _IFS4_AD1D25IF_LENGTH                    0x00000001

#define _IFS4_AD1D26IF_POSITION                  0x00000004
#define _IFS4_AD1D26IF_MASK                      0x00000010
#define _IFS4_AD1D26IF_LENGTH                    0x00000001

#define _IFS4_AD1D27IF_POSITION                  0x00000005
#define _IFS4_AD1D27IF_MASK                      0x00000020
#define _IFS4_AD1D27IF_LENGTH                    0x00000001

#define _IFS4_AD1D48IF_POSITION                  0x0000001A
#define _IFS4_AD1D48IF_MASK                      0x04000000
#define _IFS4_AD1D48IF_LENGTH                    0x00000001

#define _IFS4_AD1D49IF_POSITION                  0x0000001B
#define _IFS4_AD1D49IF_MASK                      0x08000000
#define _IFS4_AD1D49IF_LENGTH                    0x00000001

#define _IFS4_AD1D50IF_POSITION                  0x0000001C
#define _IFS4_AD1D50IF_MASK                      0x10000000
#define _IFS4_AD1D50IF_LENGTH                    0x00000001

#define _IFS4_AD1D51IF_POSITION                  0x0000001D
#define _IFS4_AD1D51IF_MASK                      0x20000000
#define _IFS4_AD1D51IF_LENGTH                    0x00000001

#define _IFS4_AD1D52IF_POSITION                  0x0000001E
#define _IFS4_AD1D52IF_MASK                      0x40000000
#define _IFS4_AD1D52IF_LENGTH                    0x00000001

#define _IFS4_AD1D53IF_POSITION                  0x0000001F
#define _IFS4_AD1D53IF_MASK                      0x80000000
#define _IFS4_AD1D53IF_LENGTH                    0x00000001

#define _IFS4_w_POSITION                         0x00000000
#define _IFS4_w_MASK                             0xFFFFFFFF
#define _IFS4_w_LENGTH                           0x00000020

#define _IFS5_CMP3IF_POSITION                    0x00000000
#define _IFS5_CMP3IF_MASK                        0x00000001
#define _IFS5_CMP3IF_LENGTH                      0x00000001

#define _IFS5_CMP4IF_POSITION                    0x00000001
#define _IFS5_CMP4IF_MASK                        0x00000002
#define _IFS5_CMP4IF_LENGTH                      0x00000001

#define _IFS5_CMP5IF_POSITION                    0x00000002
#define _IFS5_CMP5IF_MASK                        0x00000004
#define _IFS5_CMP5IF_LENGTH                      0x00000001

#define _IFS5_U6EIF_POSITION                     0x00000004
#define _IFS5_U6EIF_MASK                         0x00000010
#define _IFS5_U6EIF_LENGTH                       0x00000001

#define _IFS5_U6RXIF_POSITION                    0x00000005
#define _IFS5_U6RXIF_MASK                        0x00000020
#define _IFS5_U6RXIF_LENGTH                      0x00000001

#define _IFS5_U6TXIF_POSITION                    0x00000006
#define _IFS5_U6TXIF_MASK                        0x00000040
#define _IFS5_U6TXIF_LENGTH                      0x00000001

#define _IFS5_I2C3BIF_POSITION                   0x00000013
#define _IFS5_I2C3BIF_MASK                       0x00080000
#define _IFS5_I2C3BIF_LENGTH                     0x00000001

#define _IFS5_I2C3SIF_POSITION                   0x00000014
#define _IFS5_I2C3SIF_MASK                       0x00100000
#define _IFS5_I2C3SIF_LENGTH                     0x00000001

#define _IFS5_I2C3MIF_POSITION                   0x00000015
#define _IFS5_I2C3MIF_MASK                       0x00200000
#define _IFS5_I2C3MIF_LENGTH                     0x00000001

#define _IFS5_DMA4IF_POSITION                    0x00000016
#define _IFS5_DMA4IF_MASK                        0x00400000
#define _IFS5_DMA4IF_LENGTH                      0x00000001

#define _IFS5_DMA5IF_POSITION                    0x00000017
#define _IFS5_DMA5IF_MASK                        0x00800000
#define _IFS5_DMA5IF_LENGTH                      0x00000001

#define _IFS5_DMA6IF_POSITION                    0x00000018
#define _IFS5_DMA6IF_MASK                        0x01000000
#define _IFS5_DMA6IF_LENGTH                      0x00000001

#define _IFS5_DMA7IF_POSITION                    0x00000019
#define _IFS5_DMA7IF_MASK                        0x02000000
#define _IFS5_DMA7IF_LENGTH                      0x00000001

#define _IFS5_DATAEEIF_POSITION                  0x0000001A
#define _IFS5_DATAEEIF_MASK                      0x04000000
#define _IFS5_DATAEEIF_LENGTH                    0x00000001

#define _IFS5_w_POSITION                         0x00000000
#define _IFS5_w_MASK                             0xFFFFFFFF
#define _IFS5_w_LENGTH                           0x00000020

#define _IFS6_I2C4BIF_POSITION                   0x00000002
#define _IFS6_I2C4BIF_MASK                       0x00000004
#define _IFS6_I2C4BIF_LENGTH                     0x00000001

#define _IFS6_I2C4SIF_POSITION                   0x00000003
#define _IFS6_I2C4SIF_MASK                       0x00000008
#define _IFS6_I2C4SIF_LENGTH                     0x00000001

#define _IFS6_I2C4MIF_POSITION                   0x00000004
#define _IFS6_I2C4MIF_MASK                       0x00000010
#define _IFS6_I2C4MIF_LENGTH                     0x00000001

#define _IFS6_IC10EIF_POSITION                   0x00000005
#define _IFS6_IC10EIF_MASK                       0x00000020
#define _IFS6_IC10EIF_LENGTH                     0x00000001

#define _IFS6_IC10IF_POSITION                    0x00000006
#define _IFS6_IC10IF_MASK                        0x00000040
#define _IFS6_IC10IF_LENGTH                      0x00000001

#define _IFS6_OC10IF_POSITION                    0x00000007
#define _IFS6_OC10IF_MASK                        0x00000080
#define _IFS6_OC10IF_LENGTH                      0x00000001

#define _IFS6_IC11EIF_POSITION                   0x00000008
#define _IFS6_IC11EIF_MASK                       0x00000100
#define _IFS6_IC11EIF_LENGTH                     0x00000001

#define _IFS6_IC11IF_POSITION                    0x00000009
#define _IFS6_IC11IF_MASK                        0x00000200
#define _IFS6_IC11IF_LENGTH                      0x00000001

#define _IFS6_OC11IF_POSITION                    0x0000000A
#define _IFS6_OC11IF_MASK                        0x00000400
#define _IFS6_OC11IF_LENGTH                      0x00000001

#define _IFS6_IC12EIF_POSITION                   0x0000000B
#define _IFS6_IC12EIF_MASK                       0x00000800
#define _IFS6_IC12EIF_LENGTH                     0x00000001

#define _IFS6_IC12IF_POSITION                    0x0000000C
#define _IFS6_IC12IF_MASK                        0x00001000
#define _IFS6_IC12IF_LENGTH                      0x00000001

#define _IFS6_OC12IF_POSITION                    0x0000000D
#define _IFS6_OC12IF_MASK                        0x00002000
#define _IFS6_OC12IF_LENGTH                      0x00000001

