Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpd064.h
#define _IPC45_I2C3SIS_POSITION                  0x00000000
#define _IPC45_I2C3SIS_MASK                      0x00000003
#define _IPC45_I2C3SIS_LENGTH                    0x00000002

#define _IPC45_I2C3SIP_POSITION                  0x00000002
#define _IPC45_I2C3SIP_MASK                      0x0000001C
#define _IPC45_I2C3SIP_LENGTH                    0x00000003

#define _IPC45_I2C3MIS_POSITION                  0x00000008
#define _IPC45_I2C3MIS_MASK                      0x00000300
#define _IPC45_I2C3MIS_LENGTH                    0x00000002

#define _IPC45_I2C3MIP_POSITION                  0x0000000A
#define _IPC45_I2C3MIP_MASK                      0x00001C00
#define _IPC45_I2C3MIP_LENGTH                    0x00000003

#define _IPC45_DMA4IS_POSITION                   0x00000010
#define _IPC45_DMA4IS_MASK                       0x00030000
#define _IPC45_DMA4IS_LENGTH                     0x00000002

#define _IPC45_DMA4IP_POSITION                   0x00000012
#define _IPC45_DMA4IP_MASK                       0x001C0000
#define _IPC45_DMA4IP_LENGTH                     0x00000003

#define _IPC45_DMA5IS_POSITION                   0x00000018
#define _IPC45_DMA5IS_MASK                       0x03000000
#define _IPC45_DMA5IS_LENGTH                     0x00000002

#define _IPC45_DMA5IP_POSITION                   0x0000001A
#define _IPC45_DMA5IP_MASK                       0x1C000000
#define _IPC45_DMA5IP_LENGTH                     0x00000003

#define _IPC45_w_POSITION                        0x00000000
#define _IPC45_w_MASK                            0xFFFFFFFF
#define _IPC45_w_LENGTH                          0x00000020

#define _IPC46_DMA6IS_POSITION                   0x00000000
#define _IPC46_DMA6IS_MASK                       0x00000003
#define _IPC46_DMA6IS_LENGTH                     0x00000002

#define _IPC46_DMA6IP_POSITION                   0x00000002
#define _IPC46_DMA6IP_MASK                       0x0000001C
#define _IPC46_DMA6IP_LENGTH                     0x00000003

#define _IPC46_DMA7IS_POSITION                   0x00000008
#define _IPC46_DMA7IS_MASK                       0x00000300
#define _IPC46_DMA7IS_LENGTH                     0x00000002

#define _IPC46_DMA7IP_POSITION                   0x0000000A
#define _IPC46_DMA7IP_MASK                       0x00001C00
#define _IPC46_DMA7IP_LENGTH                     0x00000003

#define _IPC46_DATAEEIS_POSITION                 0x00000010
#define _IPC46_DATAEEIS_MASK                     0x00030000
#define _IPC46_DATAEEIS_LENGTH                   0x00000002

#define _IPC46_DATAEEIP_POSITION                 0x00000012
#define _IPC46_DATAEEIP_MASK                     0x001C0000
#define _IPC46_DATAEEIP_LENGTH                   0x00000003

#define _IPC46_w_POSITION                        0x00000000
#define _IPC46_w_MASK                            0xFFFFFFFF
#define _IPC46_w_LENGTH                          0x00000020

#define _IPC47_w_POSITION                        0x00000000
#define _IPC47_w_MASK                            0xFFFFFFFF
#define _IPC47_w_LENGTH                          0x00000020

#define _IPC48_I2C4BIS_POSITION                  0x00000010
#define _IPC48_I2C4BIS_MASK                      0x00030000
#define _IPC48_I2C4BIS_LENGTH                    0x00000002

#define _IPC48_I2C4BIP_POSITION                  0x00000012
#define _IPC48_I2C4BIP_MASK                      0x001C0000
#define _IPC48_I2C4BIP_LENGTH                    0x00000003

#define _IPC48_I2C4SIS_POSITION                  0x00000018
#define _IPC48_I2C4SIS_MASK                      0x03000000
#define _IPC48_I2C4SIS_LENGTH                    0x00000002

#define _IPC48_I2C4SIP_POSITION                  0x0000001A
#define _IPC48_I2C4SIP_MASK                      0x1C000000
#define _IPC48_I2C4SIP_LENGTH                    0x00000003

#define _IPC48_w_POSITION                        0x00000000
#define _IPC48_w_MASK                            0xFFFFFFFF
#define _IPC48_w_LENGTH                          0x00000020

#define _IPC49_I2C4MIS_POSITION                  0x00000000
#define _IPC49_I2C4MIS_MASK                      0x00000003
#define _IPC49_I2C4MIS_LENGTH                    0x00000002

#define _IPC49_I2C4MIP_POSITION                  0x00000002
#define _IPC49_I2C4MIP_MASK                      0x0000001C
#define _IPC49_I2C4MIP_LENGTH                    0x00000003

#define _IPC49_IC10EIS_POSITION                  0x00000008
#define _IPC49_IC10EIS_MASK                      0x00000300
#define _IPC49_IC10EIS_LENGTH                    0x00000002

#define _IPC49_IC10EIP_POSITION                  0x0000000A
#define _IPC49_IC10EIP_MASK                      0x00001C00
#define _IPC49_IC10EIP_LENGTH                    0x00000003

#define _IPC49_IC10IS_POSITION                   0x00000010
#define _IPC49_IC10IS_MASK                       0x00030000
#define _IPC49_IC10IS_LENGTH                     0x00000002

#define _IPC49_IC10IP_POSITION                   0x00000012
#define _IPC49_IC10IP_MASK                       0x001C0000
#define _IPC49_IC10IP_LENGTH                     0x00000003

#define _IPC49_OC10IS_POSITION                   0x00000018
#define _IPC49_OC10IS_MASK                       0x03000000
#define _IPC49_OC10IS_LENGTH                     0x00000002

#define _IPC49_OC10IP_POSITION                   0x0000001A
#define _IPC49_OC10IP_MASK                       0x1C000000
#define _IPC49_OC10IP_LENGTH                     0x00000003

#define _IPC49_w_POSITION                        0x00000000
#define _IPC49_w_MASK                            0xFFFFFFFF
#define _IPC49_w_LENGTH                          0x00000020

#define _IPC50_IC11EIS_POSITION                  0x00000000
#define _IPC50_IC11EIS_MASK                      0x00000003
#define _IPC50_IC11EIS_LENGTH                    0x00000002

#define _IPC50_IC11EIP_POSITION                  0x00000002
#define _IPC50_IC11EIP_MASK                      0x0000001C
#define _IPC50_IC11EIP_LENGTH                    0x00000003

#define _IPC50_IC11IS_POSITION                   0x00000008
#define _IPC50_IC11IS_MASK                       0x00000300
#define _IPC50_IC11IS_LENGTH                     0x00000002

#define _IPC50_IC11IP_POSITION                   0x0000000A
#define _IPC50_IC11IP_MASK                       0x00001C00
#define _IPC50_IC11IP_LENGTH                     0x00000003

#define _IPC50_OC11IS_POSITION                   0x00000010
#define _IPC50_OC11IS_MASK                       0x00030000
#define _IPC50_OC11IS_LENGTH                     0x00000002

#define _IPC50_OC11IP_POSITION                   0x00000012
#define _IPC50_OC11IP_MASK                       0x001C0000
#define _IPC50_OC11IP_LENGTH                     0x00000003

#define _IPC50_IC12EIS_POSITION                  0x00000018
#define _IPC50_IC12EIS_MASK                      0x03000000
#define _IPC50_IC12EIS_LENGTH                    0x00000002

