Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.5.130/include/proc/p32mk0512gpd064.h
#define _ADCCON2_BGVRIEN_POSITION                0x0000000F
#define _ADCCON2_BGVRIEN_MASK                    0x00008000
#define _ADCCON2_BGVRIEN_LENGTH                  0x00000001

#define _ADCCON2_SAMC_POSITION                   0x00000010
#define _ADCCON2_SAMC_MASK                       0x03FF0000
#define _ADCCON2_SAMC_LENGTH                     0x0000000A

#define _ADCCON2_CVDCPL_POSITION                 0x0000001A
#define _ADCCON2_CVDCPL_MASK                     0x1C000000
#define _ADCCON2_CVDCPL_LENGTH                   0x00000003

#define _ADCCON2_EOSRDY_POSITION                 0x0000001D
#define _ADCCON2_EOSRDY_MASK                     0x20000000
#define _ADCCON2_EOSRDY_LENGTH                   0x00000001

#define _ADCCON2_REFFLT_POSITION                 0x0000001E
#define _ADCCON2_REFFLT_MASK                     0x40000000
#define _ADCCON2_REFFLT_LENGTH                   0x00000001

#define _ADCCON2_BGVRRDY_POSITION                0x0000001F
#define _ADCCON2_BGVRRDY_MASK                    0x80000000
#define _ADCCON2_BGVRRDY_LENGTH                  0x00000001

#define _ADCCON3_ADINSEL_POSITION                0x00000000
#define _ADCCON3_ADINSEL_MASK                    0x0000003F
#define _ADCCON3_ADINSEL_LENGTH                  0x00000006

#define _ADCCON3_GSWTRG_POSITION                 0x00000006
#define _ADCCON3_GSWTRG_MASK                     0x00000040
#define _ADCCON3_GSWTRG_LENGTH                   0x00000001

#define _ADCCON3_GLSWTRG_POSITION                0x00000007
#define _ADCCON3_GLSWTRG_MASK                    0x00000080
#define _ADCCON3_GLSWTRG_LENGTH                  0x00000001

#define _ADCCON3_RQCNVRT_POSITION                0x00000008
#define _ADCCON3_RQCNVRT_MASK                    0x00000100
#define _ADCCON3_RQCNVRT_LENGTH                  0x00000001

#define _ADCCON3_SAMP_POSITION                   0x00000009
#define _ADCCON3_SAMP_MASK                       0x00000200
#define _ADCCON3_SAMP_LENGTH                     0x00000001

#define _ADCCON3_UPDRDY_POSITION                 0x0000000A
#define _ADCCON3_UPDRDY_MASK                     0x00000400
#define _ADCCON3_UPDRDY_LENGTH                   0x00000001

#define _ADCCON3_UPDIEN_POSITION                 0x0000000B
#define _ADCCON3_UPDIEN_MASK                     0x00000800
#define _ADCCON3_UPDIEN_LENGTH                   0x00000001

#define _ADCCON3_TRGSUSP_POSITION                0x0000000C
#define _ADCCON3_TRGSUSP_MASK                    0x00001000
#define _ADCCON3_TRGSUSP_LENGTH                  0x00000001

#define _ADCCON3_VREFSEL_POSITION                0x0000000D
#define _ADCCON3_VREFSEL_MASK                    0x0000E000
#define _ADCCON3_VREFSEL_LENGTH                  0x00000003

#define _ADCCON3_DIGEN0_POSITION                 0x00000010
#define _ADCCON3_DIGEN0_MASK                     0x00010000
#define _ADCCON3_DIGEN0_LENGTH                   0x00000001

#define _ADCCON3_DIGEN1_POSITION                 0x00000011
#define _ADCCON3_DIGEN1_MASK                     0x00020000
#define _ADCCON3_DIGEN1_LENGTH                   0x00000001

#define _ADCCON3_DIGEN2_POSITION                 0x00000012
#define _ADCCON3_DIGEN2_MASK                     0x00040000
#define _ADCCON3_DIGEN2_LENGTH                   0x00000001

#define _ADCCON3_DIGEN3_POSITION                 0x00000013
#define _ADCCON3_DIGEN3_MASK                     0x00080000
#define _ADCCON3_DIGEN3_LENGTH                   0x00000001

#define _ADCCON3_DIGEN4_POSITION                 0x00000014
#define _ADCCON3_DIGEN4_MASK                     0x00100000
#define _ADCCON3_DIGEN4_LENGTH                   0x00000001

#define _ADCCON3_DIGEN5_POSITION                 0x00000015
#define _ADCCON3_DIGEN5_MASK                     0x00200000
#define _ADCCON3_DIGEN5_LENGTH                   0x00000001

#define _ADCCON3_DIGEN7_POSITION                 0x00000017
#define _ADCCON3_DIGEN7_MASK                     0x00800000
#define _ADCCON3_DIGEN7_LENGTH                   0x00000001

#define _ADCCON3_CONCLKDIV_POSITION              0x00000018
#define _ADCCON3_CONCLKDIV_MASK                  0x3F000000
#define _ADCCON3_CONCLKDIV_LENGTH                0x00000006

#define _ADCCON3_ADCSEL_POSITION                 0x0000001E
#define _ADCCON3_ADCSEL_MASK                     0xC0000000
#define _ADCCON3_ADCSEL_LENGTH                   0x00000002

#define _ADCTRGMODE_SSAMPEN0_POSITION            0x00000000
#define _ADCTRGMODE_SSAMPEN0_MASK                0x00000001
#define _ADCTRGMODE_SSAMPEN0_LENGTH              0x00000001

#define _ADCTRGMODE_SSAMPEN1_POSITION            0x00000001
#define _ADCTRGMODE_SSAMPEN1_MASK                0x00000002
#define _ADCTRGMODE_SSAMPEN1_LENGTH              0x00000001

#define _ADCTRGMODE_SSAMPEN2_POSITION            0x00000002
#define _ADCTRGMODE_SSAMPEN2_MASK                0x00000004
#define _ADCTRGMODE_SSAMPEN2_LENGTH              0x00000001

#define _ADCTRGMODE_SSAMPEN3_POSITION            0x00000003
#define _ADCTRGMODE_SSAMPEN3_MASK                0x00000008
#define _ADCTRGMODE_SSAMPEN3_LENGTH              0x00000001

#define _ADCTRGMODE_SSAMPEN4_POSITION            0x00000004
#define _ADCTRGMODE_SSAMPEN4_MASK                0x00000010
#define _ADCTRGMODE_SSAMPEN4_LENGTH              0x00000001

#define _ADCTRGMODE_SSAMPEN5_POSITION            0x00000005
#define _ADCTRGMODE_SSAMPEN5_MASK                0x00000020
#define _ADCTRGMODE_SSAMPEN5_LENGTH              0x00000001

#define _ADCTRGMODE_STRGEN0_POSITION             0x00000008
#define _ADCTRGMODE_STRGEN0_MASK                 0x00000100
#define _ADCTRGMODE_STRGEN0_LENGTH               0x00000001

#define _ADCTRGMODE_STRGEN1_POSITION             0x00000009
#define _ADCTRGMODE_STRGEN1_MASK                 0x00000200
#define _ADCTRGMODE_STRGEN1_LENGTH               0x00000001

#define _ADCTRGMODE_STRGEN2_POSITION             0x0000000A
#define _ADCTRGMODE_STRGEN2_MASK                 0x00000400
#define _ADCTRGMODE_STRGEN2_LENGTH               0x00000001

#define _ADCTRGMODE_STRGEN3_POSITION             0x0000000B
#define _ADCTRGMODE_STRGEN3_MASK                 0x00000800
#define _ADCTRGMODE_STRGEN3_LENGTH               0x00000001

#define _ADCTRGMODE_STRGEN4_POSITION             0x0000000C
#define _ADCTRGMODE_STRGEN4_MASK                 0x00001000
#define _ADCTRGMODE_STRGEN4_LENGTH               0x00000001

#define _ADCTRGMODE_STRGEN5_POSITION             0x0000000D
#define _ADCTRGMODE_STRGEN5_MASK                 0x00002000
#define _ADCTRGMODE_STRGEN5_LENGTH               0x00000001

